tutorials/lesCavitatingFoam/throttle/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

startFrom                  latestTime;

startTime                  0;

stopAt                     endTime;

endTime                    2e-4;

deltaT                     1e-8;

writeControl               adjustableRunTime;

writeInterval              2e-5;

purgeWrite                 0;

writeFormat                binary;

writePrecision             6;

writeCompression           compressed;

timeFormat                 general;

runTimeModifiable          yes;

adjustTimeStep             on;

maxCo                      0.5;

maxAcousticCo              50.0;

functions
(
/*
    fieldAverage1
    {
        // Type of functionObject
        type fieldAverage;

        // Where to load it from (if not already in solver)
        functionObjectLibs ("libfieldAverage.so");

        // Fields to be probed. runTime modifiable!
        fields
        (
            U
            {
                mean            on;
                prime2Mean      off;
                base            time;
            }
            p
            {
                mean            on;
                prime2Mean      off;
                base            time;
            }
            gamma
            {
                mean            on;
                prime2Mean      off;
                base            time;
            }
        );
    }
*/
);

// ************************************************************************* //
